In [3]:

import pandas as pd

report_data = {'hotel_name':['nishat', 'Pc', 'sarina', 'islamabad', 'mariet', 'hilton'], 'room_no':[608,439,801,884,3020,3256], 'windows':[2,1,4,5,3,8]}

df = pd.DataFrame(report_data)

print(df)

  hotel_name  room_no  windows
0     nishat      608        2
1         Pc      439        1
2     sarina      801        4
3  islamabad      884        5
4     mariet     3020        3
5     hilton     3256        8

In [5]:
df[0:5]

  hotel_name  room_no  windows
0     nishat      608        2
1         Pc      439        1
2     sarina      801        4
3  islamabad      884        5
4     mariet     3020        3